test/fixtures/http/paypal/ipn-cancel.txt

payment_cycle=Daily&txn_type=recurring_payment_profile_cancel&last_name=Levesque&next_payment_date=N/A&residence_country=CA&initial_payment_amount=0.00&currency_code=USD&time_created=18%3A44%3A29+Jan+02%2C+2021+PST&verify_sign=Ab9GqN77tIrXe20oyfXtzTVqk4q1ADZ0S5jAQI9MLW3761RKjjSJYfdv&period_type=+Regular&payer_status=unverified&tax=0.00&payer_email=levesque.martin%40gmail.com&first_name=Martin&receiver_email=info%40openode.io&payer_id=G3A62CTSVEHRW&product_type=1&shipping=0.00&amount_per_cycle=1.00&profile_status=Cancelled&charset=windows-1252&notify_version=3.9&amount=1.00&outstanding_balance=0.00&recurring_payment_id=I-C07GLHXGP65Y&product_name=openode+test&ipn_track_id=924c4eb589c62

